БухЭксп/InformationRegisters/КонтрагентыБизнесСеть.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыБизнесСеть</Name>
			<Comment>Организации, зарегистрированные в сервисе 1С:Бизнес-сеть</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор 1С:Бизнес-сети</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/КонтрагентыБизнесСеть/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. БизнесСеть.АктуализироватьИдентификаторыОрганизацийКонтрагентов
Процедура Актуализировать() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = НовыйЗапросКонтрагентыДляКэширования();
	ТаблицаПоиска = БизнесСетьСлужебный.НоваяТаблицаПоиска();
	Контрагент = Неопределено;
	
	Пока Истина Цикл
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			//@skip-check property-return-type - Особенность строгой типизации
			Контрагент = ВыборкаЗапроса.Контрагент; // ОпределяемыйТип.ОрганизацияКонтрагентEDI
			//@skip-check property-return-type - Особенность строгой типизации
			ИНН = ВыборкаЗапроса.ИНН; // Строка
			//@skip-check property-return-type - Особенность строгой типизации
			КПП = ВыборкаЗапроса.КПП; // Строка
			//@skip-check property-return-type - Особенность строгой типизации
			Закеширован = ВыборкаЗапроса.Закеширован; // Булево
			
			// Нормализуем значение, полученные из прикладных данных
			ИНН = СокрЛП(ИНН);
			КПП = СокрЛП(КПП);
			
			Если Не БизнесСетьСлужебный.ЭтоИННКПП(ИНН, КПП) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаПоиска.Добавить();
			НоваяСтрока.Ссылка = Контрагент;
			НоваяСтрока.ИНН = ИНН;
			НоваяСтрока.КПП = КПП;
			НоваяСтрока.Закеширован = Закеширован;
			
		КонецЦикла;
		
	КонецЦикла;
	
	БизнесСетьСлужебный.ВыполнитьПоискКонтрагентов(ТаблицаПоиска);
	
	ЗаписатьКонтрагентов(ТаблицаПоиска);
	
КонецПроцедуры

Процедура ОбновитьКэшДанныхКонтрагентаБизнесСети(Знач ДанныеКонтрагентов, Отказ, ТекстОшибки = "") Экспорт
	
	Если ДанныеКонтрагентов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КонтрагентыБизнесСеть");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ДанныеКонтрагентов;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
		Блокировка.Заблокировать();
		
		Для Каждого ДанныеКонтрагента Из ДанныеКонтрагентов Цикл
			Если Не ЗначениеЗаполнено(ДанныеКонтрагента.Контрагент) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(ДанныеКонтрагента.Контрагент);
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ДанныеКонтрагента);
			НаборЗаписей.Записать();
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Отказ = Истина;
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Метод-конструктор результата актуализации кэша
// 
// Возвращаемое значение:
//  Структура:
// * Отказ             - Булево - Признак ошибки при выполнении задания
// * КоличествоЗаписей - Число  - Количество обновленных записей кэша
// * ТекстОшибки       - Число  - Текст ошибки при выполнении задания
Функция НовыйРезультатАктуализацииКешаКонтрагентов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отказ"             , Ложь);
	Результат.Вставить("КоличествоЗаписей" , 0);
	Результат.Вставить("ТекстОшибки"       , 0);
	
	Возврат Результат;
	
КонецФункции

// Новый запрос контрагенты для кэширования.
// 
// Возвращаемое значение:
//  Запрос - Запрос контрагентов, требующих актуализации
Функция НовыйЗапросКонтрагентыДляКэширования()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Контрагенты.Ссылка КАК Контрагент,
		|	&ПутьКонтрагентИНН КАК ИНН,
		|	&ПутьКонтрагентКПП КАК КПП,
		|	НЕ КонтрагентыБизнесСеть.Идентификатор ЕСТЬ NULL КАК Закеширован
		|ИЗ
		|	&ТаблицаКонтрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыБизнесСеть КАК КонтрагентыБизнесСеть
		|		ПО Контрагенты.Ссылка = КонтрагентыБизнесСеть.Контрагент
		|ГДЕ
		|	Контрагенты.Ссылка > &Контрагент
		|	И (ЕСТЬNULL(КонтрагентыБизнесСеть.ИНН, """") <> ВЫРАЗИТЬ(&ПутьКонтрагентИНН КАК СТРОКА(12))
		|		ИЛИ ЕСТЬNULL(КонтрагентыБизнесСеть.КПП, """") <> ВЫРАЗИТЬ(&ПутьКонтрагентКПП КАК СТРОКА(9)))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент";
	
	ИмяСправочникаКонтрагенты = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("Контрагенты");
	РеквизитИНН = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННКонтрагента");
	РеквизитКПП = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППКонтрагента");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаКонтрагенты", "Справочник." + ИмяСправочникаКонтрагенты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПутьКонтрагентИНН", "Контрагенты." + РеквизитИНН);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПутьКонтрагентКПП", "Контрагенты." + РеквизитКПП);

	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос;
	
КонецФункции

// Записать контрагентов.
// 
// Параметры:
//  ТаблицаПоиска - См. БизнесСетьСлужебный.НоваяТаблицаПоиска
Процедура ЗаписатьКонтрагентов(Знач ТаблицаПоиска)
	
	Если ТаблицаПоиска.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Найден", Истина);
	
	НайденныеКонтрагенты = ТаблицаПоиска.Скопировать(Отбор, "Ссылка, Идентификатор, ИНН, КПП");
	
	Порции = БизнесСетьСлужебный.РазбитьТаблицуНаПорции(
		НайденныеКонтрагенты, 1000); // Массив Из См. БизнесСетьСлужебный.НоваяТаблицаПоиска
	
	ДобавляемыеКонтрагенты = БизнесСетьСлужебный.НовыеЗарегистрированныеКонтрагенты();
	ИзмененныеКонтрагенты = БизнесСетьСлужебный.НовыеИзмененныеКонтрагенты();
	
	// Добавление и изменение записей кеша
	Для Каждого Порция Из Порции Цикл
		НачатьТранзакцию();
		Попытка
			УстановитьБлокировку(Порция);
			
			Для Каждого Строка Из Порция Цикл
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Контрагент.Установить(Строка.Ссылка);
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда
					Запись = НаборЗаписей.Добавить();
					Запись.Контрагент = Строка.Ссылка;
					
					НоваяСтрока = ДобавляемыеКонтрагенты.Добавить();
					
					НоваяСтрока.Контрагент    = Строка.Ссылка;
					НоваяСтрока.Идентификатор = Строка.Идентификатор;
					НоваяСтрока.ИНН           = Строка.ИНН;
					НоваяСтрока.КПП           = Строка.КПП;
					
				ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
					Запись = НаборЗаписей[0];
					
					Если Запись.Идентификатор <> Строка.Идентификатор Тогда
						НоваяСтрока = ИзмененныеКонтрагенты.Добавить();
						
						НоваяСтрока.Контрагент          = Строка.Ссылка;
						НоваяСтрока.НовыйИдентификатор  = Строка.Идентификатор;
						НоваяСтрока.НовыйИНН            = Строка.ИНН;
						НоваяСтрока.НовыйКПП            = Строка.КПП;
						НоваяСтрока.СтарыйИдентификатор = Запись.Идентификатор;
						НоваяСтрока.СтарыйИНН           = Запись.ИНН;
						НоваяСтрока.СтарыйКПП           = Запись.КПП;
					КонецЕсли;
					
				Иначе
					ВызватьИсключение(
						СтрШаблон(
							НСтр(
								"ru = 'Ошибка уникальностей записи регистра Контрагенты 1С:Бизнес-сеть по контрагенту %1'",
								ОбщегоНазначения.КодОсновногоЯзыка()),
							Строка.Ссылка));
				КонецЕсли;
				
				Запись.Идентификатор = Строка.Идентификатор;
				Запись.ИНН           = Строка.ИНН;
				Запись.КПП           = Строка.КПП;
				
				НаборЗаписей.Записать(Истина);
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Найден", Ложь);
	Отбор.Вставить("Закеширован", Истина);
	
	НайденныеКонтрагенты = ТаблицаПоиска.Скопировать(Отбор, "Ссылка, Идентификатор");
	
	Порции = БизнесСетьСлужебный.РазбитьТаблицуНаПорции(
		НайденныеКонтрагенты, 1000); // Массив Из См. БизнесСетьСлужебный.НоваяТаблицаПоиска
	
	// Удаление записей кеша
	Для Каждого Порция Из Порции Цикл
		НачатьТранзакцию();
		Попытка
			УстановитьБлокировку(Порция);
			
			Для Каждого Строка Из Порция Цикл
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Контрагент.Установить(Строка.Ссылка);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда
					Продолжить; // Запись удалена в другом сеансе
				ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
					Запись      = НаборЗаписей[0];
					
					НоваяСтрока = ИзмененныеКонтрагенты.Добавить();
					
					НоваяСтрока.Контрагент          = Строка.Ссылка;
					НоваяСтрока.СтарыйИдентификатор = Запись.Идентификатор;
					НоваяСтрока.СтарыйИНН           = Запись.ИНН;
					НоваяСтрока.СтарыйКПП           = Запись.КПП;
					
					НаборЗаписей.Очистить();
				Иначе
					ВызватьИсключение(
						СтрШаблон(
							НСтр(
								"ru = 'Ошибка уникальностей записи регистра Контрагенты 1С:Бизнес-сеть по контрагенту %1'",
								ОбщегоНазначения.КодОсновногоЯзыка()),
							Строка.Ссылка));
				КонецЕсли;
				
				НаборЗаписей.Записать(Истина);
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки
	КонецЦикла;
	
	БизнесСетьСлужебный.ПриРегистрацииКонтрагентов(ДобавляемыеКонтрагенты);
	БизнесСетьСлужебный.ПриИзмененииИдентификаторовКонтрагентов(ИзмененныеКонтрагенты);
	
КонецПроцедуры

// Устанавливает исключительную блокировку таблицы для записи
// 
// Параметры:
//  ТаблицаПоиска - См. БизнесСетьСлужебный.НоваяТаблицаПоиска
Процедура УстановитьБлокировку(Знач ТаблицаПоиска)
	
	Контекст = "РегистрыСведений.КонтрагентыБизнесСеть.УстановитьБлокировку";
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТранзакцияАктивна(),
		НСтр(
			"ru = 'Вызов метода вне транзакции не допускается'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Контекст);
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.КонтрагентыБизнесСеть.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаПоиска;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Ссылка");

	//@skip-check lock-out-of-try
	Блокировка.Заблокировать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
